Revit 2027 API
ParameterTypeId.RoomDepartment Property
 "Department"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoomDepartment { get; }
Public Shared ReadOnly Property RoomDepartment As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoomDepartment {
	ForgeTypeId^ get ();
}
static member RoomDepartment : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace